<a href="https://colab.research.google.com/github/ido177/colab/blob/main/udemy/housing.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [3]:
!gdown --id 1TWOw7jZVOpENjT8lUa6xHYjD4mZW1GOb

Downloading...
From: https://drive.google.com/uc?id=1TWOw7jZVOpENjT8lUa6xHYjD4mZW1GOb
To: /content/London+Housing+Data.csv
100% 623k/623k [00:00<00:00, 84.6MB/s]

In [4]:
df = pd.read_csv(r'/content/London+Housing+Data.csv')

In [5]:
df

            date            area  ...  houses_sold no_of_crimes
0       1/1/1995  city of london  ...         17.0          NaN
1       2/1/1995  city of london  ...          7.0          NaN
2       3/1/1995  city of london  ...         14.0          NaN
3       4/1/1995  city of london  ...          7.0          NaN
4       5/1/1995  city of london  ...         10.0          NaN
...          ...             ...  ...          ...          ...
13544   9/1/2019         england  ...      64605.0          NaN
13545  10/1/2019         england  ...      68677.0          NaN
13546  11/1/2019         england  ...      67814.0          NaN
13547  12/1/2019         england  ...          NaN          NaN
13548   1/1/2020         england  ...          NaN          NaN

[13549 rows x 6 columns]

1. Convert the data type of 'Date' column to date-time format

In [6]:
df['date'] = pd.to_datetime(df.date)

In [7]:
df

            date            area  ...  houses_sold no_of_crimes
0     1995-01-01  city of london  ...         17.0          NaN
1     1995-02-01  city of london  ...          7.0          NaN
2     1995-03-01  city of london  ...         14.0          NaN
3     1995-04-01  city of london  ...          7.0          NaN
4     1995-05-01  city of london  ...         10.0          NaN
...          ...             ...  ...          ...          ...
13544 2019-09-01         england  ...      64605.0          NaN
13545 2019-10-01         england  ...      68677.0          NaN
13546 2019-11-01         england  ...      67814.0          NaN
13547 2019-12-01         england  ...          NaN          NaN
13548 2020-01-01         england  ...          NaN          NaN

[13549 rows x 6 columns]

2. Add a new column 'Year' on the dataframe which contains years only

In [8]:
df['year'] = df.date.dt.year

In [9]:
df.head(1)

        date            area  average_price  ... houses_sold  no_of_crimes  year
0 1995-01-01  city of london          91449  ...        17.0           NaN  1995

[1 rows x 7 columns]

3. To add a month as a new column, between date and area

In [16]:
df.insert(1, 'month', df.date.dt.month) # 1 - index of the column

In [13]:
df.head(1)

        date  month            area  ...  houses_sold no_of_crimes  year
0 1995-01-01      1  city of london  ...         17.0          NaN  1995

[1 rows x 8 columns]

4. Remove the column year and month

In [18]:
df.drop(['year', 'month'], axis=1, inplace=True)

In [19]:
df.head(1)

        date            area  ...  houses_sold no_of_crimes
0 1995-01-01  city of london  ...         17.0          NaN

[1 rows x 6 columns]

5. Show all the records where 'no of crimes' is zero and how many such records

In [25]:
len(df[df.no_of_crimes == 0])

104

6. What is the max and min average_price per year in england

In [26]:
df.head(1)

        date            area  ...  houses_sold no_of_crimes
0 1995-01-01  city of london  ...         17.0          NaN

[1 rows x 6 columns]

In [27]:
df['year'] = df.date.dt.year

In [31]:
df[df.area == 'england']

            date     area  average_price  ... houses_sold  no_of_crimes  year
13248 1995-01-01  england          53203  ...     47639.0           NaN  1995
13249 1995-02-01  england          53096  ...     47880.0           NaN  1995
13250 1995-03-01  england          53201  ...     67025.0           NaN  1995
13251 1995-04-01  england          53591  ...     56925.0           NaN  1995
13252 1995-05-01  england          53678  ...     64192.0           NaN  1995
...          ...      ...            ...  ...         ...           ...   ...
13544 2019-09-01  england         249942  ...     64605.0           NaN  2019
13545 2019-10-01  england         249376  ...     68677.0           NaN  2019
13546 2019-11-01  england         248515  ...     67814.0           NaN  2019
13547 2019-12-01  england         250410  ...         NaN           NaN  2019
13548 2020-01-01  england         247355  ...         NaN           NaN  2020

[301 rows x 7 columns]

In [32]:
df1 = df[df.area == 'england']

In [35]:
df1.groupby('year').average_price.max()
#df1.groupby('year').average_price.min()

year
1995     53901
1996     55755
1997     61564
1998     65743
1999     75071
2000     84191
2001     95992
2002    119982
2003    138985
2004    160330
2005    167244
2006    182031
2007    194764
2008    191750
2009    174136
2010    180807
2011    177335
2012    180129
2013    188544
2014    203639
2015    219582
2016    231922
2017    242628
2018    248620
2019    250410
2020    247355
Name: average_price, dtype: int64

7. What is the max and min no of crimes recorded area

In [36]:
df.head(1)

        date            area  average_price  ... houses_sold  no_of_crimes  year
0 1995-01-01  city of london          91449  ...        17.0           NaN  1995

[1 rows x 7 columns]

In [37]:
df.groupby('area').no_of_crimes.max()

area
barking and dagenham      2049.0
barnet                    2893.0
bexley                    1914.0
brent                     2937.0
bromley                   2637.0
camden                    4558.0
city of london              10.0
croydon                   3263.0
ealing                    3401.0
east midlands                NaN
east of england              NaN
enfield                   2798.0
england                      NaN
greenwich                 2853.0
hackney                   3466.0
hammersmith and fulham    2645.0
haringey                  3199.0
harrow                    1763.0
havering                  1956.0
hillingdon                2819.0
hounslow                  2817.0
inner london                 NaN
islington                 3384.0
kensington and chelsea    2778.0
kingston upon thames      1379.0
lambeth                   4701.0
lewisham                  2813.0
london                       NaN
merton                    1623.0
newham                    3668.0
north east                   NaN
north west                   NaN
outer london                 NaN
redbridge                 2560.0
richmond upon thames      1551.0
south east                   NaN
south west                   NaN
southwark                 3821.0
sutton                    1425.0
tower hamlets             3316.0
waltham forest            2941.0
wandsworth                3051.0
west midlands                NaN
westminster               7461.0
yorks and the humber         NaN
Name: no_of_crimes, dtype: float64

In [38]:
df.groupby('area').no_of_crimes.min().sort_values(ascending=True)

area
city of london               0.0
kingston upon thames       692.0
richmond upon thames       700.0
sutton                     787.0
merton                     819.0
bexley                     860.0
harrow                     937.0
havering                  1130.0
barking and dagenham      1217.0
hammersmith and fulham    1323.0
kensington and chelsea    1347.0
bromley                   1441.0
hillingdon                1445.0
redbridge                 1487.0
greenwich                 1513.0
hounslow                  1529.0
haringey                  1536.0
waltham forest            1575.0
wandsworth                1582.0
enfield                   1635.0
tower hamlets             1646.0
lewisham                  1675.0
barnet                    1703.0
brent                     1850.0
hackney                   1870.0
ealing                    1871.0
islington                 1871.0
croydon                   2031.0
camden                    2079.0
newham                    2130.0
southwark                 2267.0
lambeth                   2381.0
westminster               3504.0
east midlands                NaN
east of england              NaN
england                      NaN
inner london                 NaN
london                       NaN
north east                   NaN
north west                   NaN
outer london                 NaN
south east                   NaN
south west                   NaN
west midlands                NaN
yorks and the humber         NaN
Name: no_of_crimes, dtype: float64

8. Show the total count of records of each area where avg price is less than 100000

In [39]:
df.head(1)

        date            area  average_price  ... houses_sold  no_of_crimes  year
0 1995-01-01  city of london          91449  ...        17.0           NaN  1995

[1 rows x 7 columns]

In [40]:
df[df.average_price < 100000].area.value_counts()

north east              112
north west              111
yorks and the humber    110
east midlands            96
west midlands            94
england                  87
barking and dagenham     85
south west               78
east of england          76
newham                   72
bexley                   64
waltham forest           64
lewisham                 62
havering                 60
greenwich                59
south east               59
croydon                  57
enfield                  54
sutton                   54
hackney                  53
redbridge                52
southwark                48
tower hamlets            47
outer london             46
hillingdon               44
hounslow                 41
lambeth                  41
brent                    40
london                   39
merton                   35
haringey                 33
bromley                  33
inner london             31
ealing                   31
harrow                   30
kingston upon thames     30
wandsworth               26
barnet                   25
islington                19
city of london           11
Name: area, dtype: int64